Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.IsNotScenarioBasedCoordinationModelType(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element)
Checks whether a Coordination Model type does not originate from a scenario.
Used as a validator to block operations on scenario-based coordination models.
document:
The document.
coordinationModelType:
The Coordination Model type element to check.
Returns:
True if the Coordination Model type does not originate from a scenario; false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The provided element is not a Coordination Model type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.IsScenarioBasedCoordinationModelType(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element)
Checks whether a Coordination Model type originates from a scenario.
Remarks:
Scenario-based coordination models are created through the Forma scenario connection
and are read-only. Their source is managed by the scenario system.
Operations such as reload, unload, and reloadFrom are blocked for scenario-based
coordination models because their lifecycle is tied to the scenario connection.
document:
The document.
coordinationModelType:
The Coordination Model type element to check.
Returns:
True if the Coordination Model type originates from a scenario; false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The provided element is not a Coordination Model type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.IsFileTypeValidForLinkingLocalCoordinationModel(System.String)
Validates the type of the file for linking it as local Coordination Model.
Remarks:
Valid file types are .nwc and .nwd.
fileId:
The file path.
Returns:
True if validation succeeds; false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.IsValidAutodeskDocsFileId(System.String)
Validates the fileId from Autodesk Docs.
Remarks:
A valid file id should start with "urn:adsk.wipprod:dm.lineage:", followed by an unique identifier.
Example : urn:adsk.wipprod:dm.lineage:AoV26TGqRjuNs4ANq84ncQ
fileId:
The file id.
Returns:
True if validation succeeds; false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.ContainsCategory(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementType,System.String)
Checks whether a provided string is a element category name in the provided AutodeskDocs Coordination Model type.
document:
The document.
coordinationModelType:
The Coordination Model type element.
categoryName:
The element category name to check.
Returns:
True if the categoryName is a element category name in the provided AutodeskDocs Coordination Model type; false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
categoryName is an empty string.
-or-
The provided element is not a Autodesk Docs Coordination Model type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.IsCoordinationModelInstance(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element)
Checks whether an element is a Coordination Model instance.
document:
The document.
element:
The element to check.
Returns:
True if the element is Coordination Model instance; false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.IsCoordinationModelType(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element)
Checks whether an element is a Coordination Model type.
document:
The document.
coordinationModelType:
The element to check.
Returns:
True if the element is Coordination Model type; false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.GetAllCoordinationModelInstanceIds(Autodesk.Revit.DB.Document)
Gets all Coordination Model instance ids in the document.
document:
The document.
Returns:
Returns the set of element ids of all Coordination Model instances in the document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.GetAllCoordinationModelTypeIds(Autodesk.Revit.DB.Document)
Gets all Coordination Model type ids in the document.
document:
The document.
Returns:
Returns the set of element ids of all Coordination Model types in the document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.GetAllPropertiesForReferenceInsideCoordinationModel(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Reference)
Gets all the properties for the provided Coordination Model instance reference.
Remarks:
Properties are available only for elements inside a Coordination Model from Autodesk Docs.
document:
The document.
coordinationModelInstance:
The Coordination Model instance element where the provided reference is found.
reference:
The reference to the element inside the provided Coordination Model instance.
Returns:
Returns a list of properties for the provided Coordination Model instance reference.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The element coordinationModelInstance was not found in the given document.
-or-
The provided Reference is not a valid element inside the provided Coordination Model instance.
-or-
The provided element is not a Autodesk Docs Coordination Model instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to validate web services environment.
-or-
Failed to validate authentication.
-or-
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.GetCoordinationModelTypeData(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementType)
Gets link data for the provided Coordination Model type.
document:
The document.
coordinationModelType:
The Coordination Model type element.
Returns:
Returns Coordination Model type data defining the link to the Autodesk Docs 3D view or the .nwc or .nwd file.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The element coordinationModelType was not found in the given document.
-or-
The provided element is not a Coordination Model type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.GetCategoryForReferenceInsideCoordinationModel(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Reference)
Returns the category name for the provided element reference inside the provided Coordination Model instance.
document:
The document.
coordinationModelInstance:
The Coordination Model instance element where the provided reference is found.
reference:
The reference to the element inside the provided Coordination Model instance.
Returns:
Returns the category name for the provided reference inside the Coordination Model instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The element coordinationModelInstance was not found in the given document.
-or-
The provided element is not a Autodesk Docs Coordination Model instance.
-or-
The provided Reference is not a valid element inside the provided Coordination Model instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.GetColorOverrideForCategory(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementType,System.String)
Returns the color override value for the provided element category name inside the provided Coordination Model type.
Remarks:
By default, the color setting has no override and its value is InvalidColorValue.
document:
The document.
view:
The view.
coordinationModelType:
The Coordination Model type element where the provided element category name is found.
categoryName:
The name of the element category inside the provided Coordination Model type.
Returns:
Returns the color override value for the provided element category name inside the provided Coordination Model type. InvalidColorValue means no override is set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The element coordinationModelType was not found in the given document.
-or-
The name categoryName is not a category name in the provided AutodeskDocs Coordination Model type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.SetColorOverrideForCategory(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementType,System.String,Autodesk.Revit.DB.Color)
Set the color override value for the provided element category name inside the provided Coordination Model type.
Remarks:
By default, the color setting has no override and its value is InvalidColorValue.
document:
The document.
view:
The view.
coordinationModelType:
The Coordination Model type element where the provided element category name is found.
categoryName:
The name of the element category inside the provided Coordination Model type.
color:
Color override value for the provided element category name inside the provided Coordination Model type. InvalidColorValue means no override is set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The element coordinationModelType was not found in the given document.
-or-
The name categoryName is not a category name in the provided AutodeskDocs Coordination Model type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.GetVisibilityOverrideForReferenceInsideCoordinationModel(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Reference)
Gets the visibility for the provided reference inside the Coordination Model from Autodesk Docs.
Remarks:
The reference should be a subelement of a Coordination Model instance.
By default, the visibility setting has no override and its value is true.
document:
The document.
view:
The view.
coordinationModelInstance:
The Coordination Model instance element where the provided reference is found.
reference:
The reference to the element inside the provided Coordination Model instance.
Returns:
Returns the visibility for the provided reference inside the Coordination Model instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The element coordinationModelInstance was not found in the given document.
-or-
The provided Reference is not a valid element inside the provided Coordination Model instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.SetVisibilityOverrideForReferenceInsideCoordinationModel(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Reference,System.Boolean)
Sets the visibility override for the provided reference inside the Coordination Model instance.
A value of true means that the graphics are visible.
Remarks:
The reference should be a subelement of a Coordination Model from Autodesk Docs.
The referenced element will have its visibility updated in all instances of the Coordination Model type of the provided Coordination Model instance.
By default, the visibility setting has no override and its value is true.
document:
The document.
view:
The view.
coordinationModelInstance:
The Coordination Model instance element where the provided reference is found.
reference:
The reference to the element inside the provided Coordination Model instance.
visible:
Sets the visibility override for the provided reference inside the Coordination Model instance.
A value of true means that the graphics are visible.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The element coordinationModelInstance was not found in the given document.
-or-
The provided Reference is not a valid element inside the provided Coordination Model instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.GetVisibilityOverrideForCategory(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementType,System.String)
Gets the visibility override for the provided element category name in the provided Coordination Model type.
Remarks:
By default, the visibility setting has no override and its value is true.
document:
The document.
view:
The view.
coordinationModelType:
The Coordination Model type element where the provided element category name is found.
categoryName:
The name of the element category inside the provided Coordination Model type.
Returns:
Returns the visibility override for the provided element category name in the provided Coordination Model type.
A value of true means that the graphics are visible.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The element coordinationModelType was not found in the given document.
-or-
The name categoryName is not a category name in the provided AutodeskDocs Coordination Model type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.SetVisibilityOverrideForCategory(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementType,System.String,System.Boolean)
Sets the visibility override for the provided element category name inside the provided Coordination Model type.
Remarks:
By default, the visibility setting has no override and its value is true.
document:
The document.
view:
The view.
coordinationModelType:
The Coordination Model type element where the provided element category name is found.
categoryName:
The name of the category inside the provided Coordination Model type.
visible:
Sets the visibility override for the provided element category name inside the provided Coordination Model type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The element coordinationModelType was not found in the given document.
-or-
The name categoryName is not a category name in the provided AutodeskDocs Coordination Model type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.GetColorOverride(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.Element)
Gets the color override value for the provided Coordination Model type.
Remarks:
By default, the color setting has no override and its value is InvalidColorValue.
document:
The document.
view:
The view.
coordinationModelType:
The Coordination Model type element.
Returns:
Returns the color override value of the Coordination Model type. InvalidColorValue means no override is set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The element coordinationModelType was not found in the given document.
-or-
The provided element is not a Coordination Model type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.SetColorOverride(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Color)
Sets the color override value for the provided Coordination Model type.
Remarks:
By default, the color setting has no override and its value is InvalidColorValue.
document:
The document.
view:
The view.
coordinationModelType:
The Coordination Model type element.
color:
Value of the color for the override. InvalidColorValue means no override is set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The element coordinationModelType was not found in the given document.
-or-
The provided element is not a Coordination Model type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.GetTransparencyOverride(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.Element)
Gets the transparency override value for the provided Coordination Model type.
Remarks:
Transparency must be greater than 0 and less than 100 (0 = opaque, 100 = fully transparent).
By default, the transparency setting has no override and its value is 0.
document:
The document.
view:
The view.
coordinationModelType:
The Coordination Model type element.
Returns:
Returns the transparency value (in percentage). A 0-value transparency means no override is set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The element coordinationModelType was not found in the given document.
-or-
The provided element is not a Coordination Model type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.SetTransparencyOverride(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.Element,System.Int32)
Sets the transparency override value for the provided Coordination Model type.
Remarks:
Transparency must be greater than 0 and less than 100 (0 = opaque, 100 = fully transparent).
By default, the transparency setting has no override and its value is 0.
document:
The document.
view:
The view.
coordinationModelType:
The Coordination Model type element.
transparency:
The transparency value to apply (in percentage). A 0-value transparency means no override is set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The element coordinationModelType was not found in the given document.
-or-
The provided element is not a Coordination Model type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The value is invalid. The valid range is 0 through 100
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.GetVisibilityOverride(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.Element)
Gets the visibility override for the provided Coordination Model instance or type.
Remarks:
By default, the visibility setting has no override and its value is true.
This setting does not reflect the actual visibility in canvas.
For example, if a Coordination Model instance has this visibility setting on true, it won't be visible if its Coordination Model type is hidden.
document:
The document.
view:
The view.
coordinationModelTypeOrInstance:
The Coordination Model instance or type element.
Returns:
Returns the visibility override for the provided Coordination Model instance or type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The element coordinationModelTypeOrInstance was not found in the given document.
-or-
The provided element is not a Coordination Model instance or type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.SetVisibilityOverride(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.Element,System.Boolean)
Sets the visibility override for the provided Coordination Model instance or type.
A value of true means that the graphics are visible.
Remarks:
By default, the visibility setting has no override and its value is true.
This setting does not reflect the actual visibility in canvas.
For example, if a Coordination Model instance has the visibility setting on true, it won't be visible if its Coordination Model type is hidden.
document:
The document.
view:
The view.
coordinationModelTypeOrInstance:
The Coordination Model instance or type element.
visible:
Sets the visibility override for the provided Coordination Model instance or type.
A value of true means that the graphics are visible.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The element coordinationModelTypeOrInstance was not found in the given document.
-or-
The provided element is not a Coordination Model instance or type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.Unload(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementType)
Unloads the provided Coordination Model type element.
Remarks:
This operation is blocked for Coordination Models that originate from a scenario.
Scenario-based coordination models cannot be unloaded independently as their lifecycle is tied to the scenario connection.
document:
The document.
coordinationModelType:
The Coordination Model type element to unload.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The element coordinationModelType was not found in the given document.
-or-
The provided element is not a Coordination Model type.
-or-
This operation is not supported for scenario-based coordination models. Scenario-based coordination models are read-only and their source is managed by the scenario system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
Failed to unload Coordination Model.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.ReloadAutodeskDocsCoordinationModelFrom(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementType,System.String,System.String,System.String,System.String)
Reloads a Autodesk Docs Coordination Model type from the specified Autodesk Docs data.
Remarks:
Authentication in Revit is a prerequisite for reloading Coordination Models from Autodesk Docs.
The Autodesk Docs data projectId, fileId and viewName can be retrieved from the web URL of the 3D view.
The Autodesk Docs account id can be retrieved from the Autodesk Docs Account settings.
This data can also be retrieved via the Data Management API or Autodesk Construction Cloud API.
This operation is blocked for Coordination Models that originate from a scenario.
Scenario-based coordination models are read-only and cannot have their source changed.
document:
The document.
coordinationModelType:
The Coordination Model type element to reload.
accountId:
The id of the Autodesk Docs account.
projectId:
The id of the Autodesk Docs project.
fileId:
The id of the Autodesk Docs file.
A valid file id should start with "urn:WIPENVIRONMENT:dm.lineage:", followed by an unique identifier.
The WIPENVIRONMENT varies from Region to Region.
For example, for an account created in US Region, WIPENVIRONMENT = adsk.wipprod and a valid file id would be urn:adsk.wipprod:dm.lineage:AoV26TGqRjuNs4ANq84ncQ.
viewName:
View name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Failed to validate file id.
-or-
document is not a project document.
-or-
The provided element is not a Autodesk Docs Coordination Model type.
-or-
This operation is not supported for scenario-based coordination models. Scenario-based coordination models are read-only and their source is managed by the scenario system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to validate web services environment.
-or-
Failed to validate authentication.
-or-
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
Failed to reload Coordination Model type from specified Autodesk Docs data.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.ReloadLocalCoordinationModelFrom(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementType,System.String)
Reloads a local Coordination Model type from the specified absolute path of a .nwc or .nwd file.
Remarks:
In case the file path is not an absolute path, it is considered to be relative to the Revit document's saved path.
document:
The document.
coordinationModelType:
The Coordination Model type element to reload.
filePath:
The file's absolute or relative path to reload from.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Failed to validate file type.
-or-
document is not a project document.
-or-
The provided element is not a local Coordination Model type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given filePath does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
Failed to reload Coordination Model type from specified path.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.Reload(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementType)
Reloads the provided Coordination Model type element.
Remarks:
For a Coordination Model from Autodesk Docs, reload will get the latest version for the provided Coordination Model type element.
Authentication in Revit is a prerequisite for reloading Coordination Models from Autodesk Docs.
This operation is blocked for Coordination Models that originate from a scenario.
Scenario-based coordination models are read-only and their source is managed by the scenario system.
document:
The document.
coordinationModelType:
The Coordination Model type element to reload.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The element coordinationModelType was not found in the given document.
-or-
The provided element is not a Coordination Model type.
-or-
This operation is not supported for scenario-based coordination models. Scenario-based coordination models are read-only and their source is managed by the scenario system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to validate web services environment.
-or-
Failed to validate user authentication.
-or-
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
Failed to reload Coordination Model.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.LinkCoordinationModelFromLocalPath(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.ExternalData.CoordinationModelLinkOptions)
Creates a Coordination Model instance using the absolute path of a .nwc or .nwd file and the linking options.
Remarks:
In case the file path is not an absolute path, it is considered to be relative to the Revit document's saved path.
document:
The document.
filePath:
The file's absolute or relative path.
linkOptions:
Options for linking.
Returns:
Returns the newly added Coordination Model instance of the local .nwc or .nwd file.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Failed to validate file type.
-or-
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given filePath does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
Failed to create Coordination Model instance from specified path.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils.Link3DViewFromAutodeskDocs(Autodesk.Revit.DB.Document,System.String,System.String,System.String,System.String,Autodesk.Revit.DB.ExternalData.CoordinationModelLinkOptions)
Creates a Coordination Model instance based on the information provided by the specified Autodesk Docs data and linking options.
Remarks:
Authentication in Revit is a prerequisite for linking Coordination Models from Autodesk Docs.
The Autodesk Docs data projectId, fileId and viewName can be retrieved from the web URL of the 3D view.
The Autodesk Docs account id can be retrieved from the Autodesk Docs Account settings.
This data can also be retrieved via the Data Management API or Autodesk Construction Cloud API.
document:
The document.
accountId:
The id of the Autodesk Docs account.
projectId:
The id of the Autodesk Docs project.
fileId:
The id of the Autodesk Docs file.
A valid file id should start with "urn:WIPENVIRONMENT:dm.lineage:", followed by an unique identifier.
The WIPENVIRONMENT varies from Region to Region.
For example, for an account created in US Region, WIPENVIRONMENT = adsk.wipprod and a valid file id would be urn:adsk.wipprod:dm.lineage:AoV26TGqRjuNs4ANq84ncQ.
viewName:
View name.
linkOptions:
Options for linking.
Returns:
Returns the newly added Coordination Model instance of the 3D view from Autodesk Docs.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Failed to validate file id.
-or-
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to validate web services environment.
-or-
Failed to validate authentication.
-or-
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
Failed to create Coordination Model instance using specified data or an internal error occured.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils
The methods provided by this utility class support the managing of Coordination Model links in Revit documents and their visibility settings control in Revit views.
Remarks:
Coordination Model links can be created from Autodesk Docs 3D views or local .nwc or .nwd files.
A Coordination Model type holds the data that defines the link to a Autodesk Docs 3D view or a local .nwc or .nwd file.
This data can be retrieved in the CoordinationModelLinkData object.
A Coordination Model type can have multiple Coordination Model instances.
Coordination Model type is an ElementType of BuiltInCategory.OST_Coordination_Model category.
Coordination Model instance is an Element of BuiltInCategory.OST_Coordination_Model category.
Since:
2026.3